--- a/README.md
+++ b/README.md
@@ -18,47 +18,38 @@
 
 > Обновляется по мере разработки
 
-```plantuml
-@startuml
-package "Native Startup"{
-folder desktopApp{
-[build.gradle.kts] --> [main.kt]
-}
-}
-folder "Shared"{
-folder commonMain {
-[main.desktop.kt]
-folder core
-folder ui
-folder resources
-folder models
+```mermaid
+graph TD
+    subgraph startup["Native Startup"]
+        subgraph desktopApp["desktopApp"]
+        fileA("build.gradle.kts")
+        fileB("main.kt")
+        fileA --> fileB
+        end
+    end
 
-     core --> [main.desktop.kt]
-     ui --> [main.desktop.kt]
-     resources --> [main.desktop.kt]
-     models --> [main.desktop.kt]
-}
-folder desktopMain{
-[App.kt]
-}
-desktopMain --> commonMain :  осуществляет
-}
+    subgraph Shared
+        subgraph common["commonMain"]
+        folderD("core")
+        folderE("ui")
+        folderF("resources")
+        folderG("models")
+        mainDesktop("main.desktop.kts")
+        folderD --> mainDesktop
+        folderE --> mainDesktop
+        folderF --> mainDesktop
+        folderG --> mainDesktop
+        end
 
-Shared --> "Native Startup"
+        subgraph desktop["desktopMain"]
+        fileApp("App.kt")
+        end
+        desktop --> common
+    end
+    legend("В commonMain - код который работает на всех системах. \n При этом для каждой системы одни и те же функции можно \n реализовать по разному в своих файлах Shared.")
 
-legend
-В commonMain - код который работает на всех системах.
-При этом для каждой системы можно одни и теже
-функции реализовать по разному в своих файлах Shared.
-end legend
-@enduml
+    Shared --> startup
 ```
-
-![Диаграмма структуры проекта в PlantUML](images/structure.jpg)
-
